<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
<style>
ul.a {
  list-style-type: circle;
}</style>
</head>
<body>
<div align="center">
<sec:authorize access="hasRole('ROLE_MASTER')">


<p>Διαχειριστής Καταλόγου Χρηστών - Ενέργειες:</p>
<ul class="a">
  <li>Eπιλογή 'Εισαγωγή Χρήστη': Με αυτή την επιλογή μπορείτε να εισάγετε έναν καινούριο χρήστη στον κατάλογο χρηστών του Πανεπιστημίου<br>
  Συμπληρώνετε τη φόρμα που εμφανίζεται στη σελίδα με τα στοιχεία του χρήστη<br>
  Εάν ο χρήστης που θα εισάγετε είναι η γραμματεία (admin) τότε συμπληρώνετε μόνο τα 3 πρώτα πεδία (τύπος χρήστη, όνομα χρήστη και κωδικό πρόσβασης)<br>
  Άν ο χρήστης είναι προπτυχιακός φοιτητής, συμπληρώνετε όλα τα πεδία εκτός από τα 2 τελευταία (προόγραμμα και κατέυθυνση)</li>
  <li>Eπιλογή 'Ανανέωση Χρήστη'</li>
  <li>Eπιλογή 'Διαγραφή Χρήστη'</li>
</ul>

</sec:authorize>
<sec:authorize access="hasRole('ROLE_USER')">


<p>Προπτυχιακός-Μεταπτυχιακός Φοιτητής - Ενέργειες:</p>
<ul class="a">
  <li>Δήλωση πτυχιακής εργασίας <br>Επιλέγετε απο το μενού επιλογών το τμήμα στο οποίο είστε και επιτρέπεται να δηλώσετε πτυχιακή εργασία<br>
  Επιλέγετε την πτυχιακή εργασία που επιθυμείτε και πατάτε 'Υποβολή'</li> 
</ul>

</sec:authorize>
<sec:authorize access="hasRole('ROLE_ADMIN')">


<p>Γραμματεία - Ενέργειες:</p>
<ul class="a">
  <li>Ενεργοποίηση όλων των φοιτητών του Πανεπιστημίου για να μπορούν να δηλώσουν πτυχιακή εργασία <br>
  Πατάτε την επιλογή 'Συνέχεια'  στη σελίδα που θα εμφανιστεί και στην συνέχεια ενεργοποιείτε τους φοιτητές.
  </li> 
</ul>

</sec:authorize>
</div>
</body>
</html>